EDT/УТ/src/Documents/новаНазначениеСхемыНачисленияЗарплаты/новаНазначениеСхемыНачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаНазначениеСхемыНачисленияЗарплаты</name>
  <registerRecords>InformationRegister.новаСхемыНачисленияЗарплатыСотрудников</registerRecords>
  <attributes>
    <name>ДатаНазначения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СхемаНачисленияЗарплаты</name>
      <type>
        <types>CatalogRef.новаСхемыНачисленияЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/новаСхемыНачисленияЗарплатыСотрудников/новаСхемыНачисленияЗарплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаСхемыНачисленияЗарплатыСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СхемаНачисленияЗарплаты</name>
    <type>
      <types>CatalogRef.новаСхемыНачисленияЗарплаты</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/новаНазначениеСхемыНачисленияЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Не ЗначениеЗаполнено(ДатаНазначения) Тогда
		Сообщить("Не указана дата назначения!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого стрСотрудник Из Сотрудники Цикл
		Если Не ЗначениеЗаполнено(стрСотрудник.Сотрудник) Тогда
			Сообщить("Строка " + Строка(стрСотрудник.НомерСтроки) + ": не заполнен сотрудник!", СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.новаСхемыНачисленияЗарплатыСотрудников.Добавить();
		Движение.Период = ДатаНазначения;
		ЗаполнитьЗначенияСвойств(Движение, стрСотрудник);
	КонецЦикла;
КонецПроцедуры
